package com.javaex.practice;

public class Ex06 {
	public static void main(String[] args) {
		
		/*
		 아래의 설명중 틀린 것을 찾아서 수정해 보세요. 
			(1) 변수한개에는 동시에 여러 개의 값을 담을 수 있다.   ==> 하나만 가능
			(2) 변수는 선언시에 사용한 타입의 값만 저장할 수 있다.  ==> 형변환 되면 다른 타입도 가능
			(3) 변수는 초기값이 저장되지 않아도 읽을 수 있다. ==> 읽을 값이 없어서 못읽지 않나??
			(4) 모든 자료형의 변수는 동일한 방식으로 저장된다.  ==> 동일하지 않다
			(5) double형은 flaot보다 큰 수를 담을 수 있다. ==> 큰 수가 아니고 실제값에 가까운 수
			(6) int, float, char, String은 모두 기본자료형에 속한다  ==> String은 예외 
			(7) final로 선언된 변수는 수정이 가능하다   ==> 불가능
			(8) long형은 항상 L을 붙여서 대입해야한다.  ==> int를 넘을때만 
			(9) float형은 항상 F을 붙여서 대입해야한다.
		*/
	}

}
